{
    "title": "B.Tech Artificial Intelligence and Data Science, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "B.Tech Artificial Intelligence and Data Science  (4 Year Undergraduate Engineering Program)",
        "B.Tech Artificial Intelligence and Data Science",
        "Discover Course",
        "ebia",
        "",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "58% of all organisations foresee modifications in their business model due to AI within five years - Forbes Report",
        "58% of all organisations foresee modifications their business model due to AI within five years - Forbes Report",
        "A rapidly growing field across all industries is Artificial Intelligence and Data Science, that provides students with high-level computer abilities as well as a full grasp across all sectors.",
        "You will learn how to work with AI to harness the strategic advantage it offers in making more informed decision-making and increased efficiency and profitability. You will learn about the transformative power of AI and use it to solve real world challenges. When you graduate from KPRIET, you will be able to design and implement systems and applications in Hitech AI and Data science labs.",
        "This program will prepare you for one of the world’s most exciting technology frontiers.",
        "This is a very practical engineering degree where you will develop AI apps and platforms to understand the role of AI in future technology. Students will learn strong problem solving and analytical skills in Artificial Intelligence and Data Science Course at KPR institute of Engineering and Technology",
        "According to US Bureau of Labor Statistics, employment for Artificial Intelligence and Data Science engineers are projected to grow 24% by 2024.",
        "To be a department with global recognition through innovative teaching process, product development and research excellence in Artificial Intelligence and Data Science.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6 (Lateral Entry)",
        "Intake / No. of Seats: 60",
        "The Program Educational Objectives (PEOs) of the Artificial Intelligence and Data Science (AD) represent major accomplishments that the graduates are expected to achieve after three to five years of graduation",
        "PEO 1: Acquire the expertise in artificial intelligence and data science essential for real-time problems.",
        "PEO 2: Have the abilities to establish teams, exhibit leadership traits, and uphold moral principles that are crucial for operating ethically and professionally.",
        "PEO 3: Develop the necessary competencies to become entrepreneurs, data scientists, and business owners in the field of artificial intelligence and data science.",
        "PEO 4: Continue to learn technological advancements through higher studies and research.",
        "Graduates of Artificial Intelligence and Data Science department will be able to",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "PSO 1: Integrate the foundations of mathematical, analytical, programming and domain knowledge to build AI enabled systems for solving real world problems",
        "PSO 2:  Acquire skills to model the data science assisted systems and to analyse the data to solve business related problem",
        "To enhance the learning experience, we have integrated industry curriculum in the course. This helps students to learn practically in the real time and get a chance to solve real world problems.",
        "At KPR Institute of Engineering and Technology, Industries regularly contribute to the course through seminars, workshops, conducting short term courses, hackathons etc. You don’t just learn, you learn beyond.",
        "We train our Engineering graduates from the first year onwards to achieve their dream career. Xebia Academy aims to bridge the gap between the on-ground technologies and ambitious individuals, bringing proficiency to the industry.",
        "Details",
        "You will have six fundamental subjects and choose two electives in the first year. In the second year students will learn through projects and research. Third year students will get an opportunity to learn real time intensive project partnering with industry. The final semester will end with a Project and Internship at Industry.",
        "More Details",
        "B.Tech Artificial Intelligence and Data Science makes the student to gain high level computing knowledge along with a deep knowledge in artificial intelligence and data science. Students will get an opportunity to pursue their career as an AI professional in the emerging area.",
        "Job titles for Artificial Intelligence and Data Science Engineering students are very diverse, and may include, AI Engineer, Data Scientist, Business Intelligence Strategist, Research Scientist, Data Mining Engineer, Machine Learning Engineer Etc.,",
        "Know more about Department of Artificial Intelligence and Data Science at KPR Institute of Engineering and Technology",
        "When it comes to high-performance in the field of Data Science and Big Data analysis, the iMac High-end Machines have emerged as a clear leaders in recent years. iMac has long been a popular platform for Data Scientist.",
        "Data scientists combine technology and social science both together to detect trends and manage data using Macs powered by all-new M1 CPUs and the Pattern Recognition computed framework available in macOS Big Sur and Monterey.",
        "Any workload can be easily handled by a super-fast processor and graphics, enormous memory, and all-flash storage.",
        "",
        "Artificial Intelligence Laboratory",
        "Powered by Apple Inc.",
        "",
        "Data Science Laboratory",
        "Powered by Apple Inc.",
        "",
        "",
        "",
        "",
        "",
        "",
        "iMac has all the power Big Data analysts and Data scientists needs to analyse massive air quality dataset and to render a stunning visualisations of the findings on interactive dashboards. Apple Technology is being used by top professors and students to propel improvements across every field.",
        "KPRIET uses Apple technology to power its innovation centre and to give the entire AI & DS department a competitive edge. Students from AI & DS course uses advanced incubator space to build iOS Apps that can be used world widely. Apple Inc. powered Laboratories can help holistic students success in a hybrid learning environment.",
        "Who can study B.Tech in Artificial Intelligence and Data Science Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "State-of-the-Art Artificial Intelligence and Data Science Lab inside the campus",
        "Artificial Intelligence and Data Science Engineering is an Internationally recognised degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what are the opportunities available for a student at KPRIET",
        "Unlock your potential with our B.Tech in Artificial Intelligence and Data Science Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}