{
    "title": "Biomedical Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Biomedical engineering is a booming career field as health and technology are coming together to revolutionize the field of medicine.",
        "Employment of biomedical engineers are projected to grow 15% over the next ten years, faster than the average of all occupations. Biomedical engineering bridges the gap between engineering and medicine, seamlessly combining the design and problem-solving skills of engineering with medical and biological sciences in order to improve healthcare diagnosis, monitoring and therapy.",
        "The study of biomedical engineering involves a broad array of diagnostic and therapeutic applications. This branch of engineering and sciences is a fascinating multidisciplinary area of study that entails the application of engineering techniques in order to assist practitioners like doctors and physicians in their healthcare practices. Study of this branch also helps them in the rehabilitation of disabled patients.",
        "To be a centre of excellence for dissemination of knowledge, research and development in biomedical engineering to serve the society with moral values.",
        "Graduates of Biomedical Engineering, four years after graduation, will;",
        "PEO 1: Apply the knowledge gained from biomedical engineering to help solve the technological problems in industries",
        "PEO 2: Design and develop healthcare products and processes through continuous skill upgradation and research",
        "PEO 3: Demonstrate professional and ethical standards of behavior and commit to lifelong learning to meet the needs of society",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "PSO 1: Design and evaluate medical solutions using biosensors, biomaterials, biomechanics, and diagnostic and therapeutic equipment for the healthcare industries.",
        "PSO 2: Identify, analyze, solve and develop algorithms for addressing healthcare problems using the software skills acquired through bio-signal and image processing advancements.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6(Lateral Entry)",
        "Intake / No. of Seats: 60",
        "Royal Care shall provide Hospital visits, projects, guest lectures, seminars, internships, and joint research support to the students and the faculty members of KPRIET.",
        "MoU with ALERT NGO to create a community of responsible and responsive Good Samaritans, by ensuring the knowledge of the First response is accessible to everyone by making it a practical, comprehensive, hands-on, and easily understood pedagogy.",
        "Valid upto 3 Years",
        "GEM Hospital shall provide support for curriculum development, guest lectures, projects, R&D support, concessional treatment etc., for the students and faculties of KPRIET.",
        "This MoU was signed to offer hands-on skill based training on Calibration and Testing of Medical Equipment, Internship Opportunities and Placement opportunities for the students.",
        "Aravind Eye Hospital shall provide experienced distinguished faculties for delivering latest technologies to students.",
        "Valid upto 3 Years",
        "Ganga Hospital shall also provide support for curriculum development, guest lectures, projects, R&D support etc., for the students and faculties of KPRIET",
        "Valid upto 3 Years",
        "Masonic Hospital shall also provide support for curriculum development, guest lectures, projects, R&D support, concessional treatment etc., for the students and faculties of KPRIET.",
        "Enables student to improve their knowledge, joint research - particularly in the fields of Biomedical engineering, value added courses and short term programmes. It also explores the possibility of offering specialized programmes in the field",
        "The Memorandum of Understanding opens doors for students to gain hands-on experience in servicing and calibrating medical equipment. It also paves the way for insightful guest lectures by industry experts, valuable internship and in-plant training opportunities, and promising career pathways within the industry.",
        "The Memorandum of Understanding facilitates in teaching the students about service and calibration of medical equipments, regular guest lectures from the industry experts, internship/inplant training and job opportunities from the industry.",
        "Who can study Biomedical Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "Application Link Click Here",
        "Industry grade biomedical engineering laboratory inside the campus",
        "Biomedical Engineering in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy - What are the opportunities available for a student at KPRIET",
        "Unlock your potential with our B.E. Biomedical Engineering Course. Explore the exceptional Academic Performance, Smart classes and personalized attention, Affordable-tuition fees and Amazing campus etc."
    ]
}