{
    "title": "Career, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "KPR Institute of Engineering and Technology has excellent opportunities to deserving candidates across academic, teaching, research and professional areas.",
        "KPR Institute of Engineering and Technology (KPRIET) is ranked (101 - 150) band under the engineering category, (151 - 200) band in overall, and (51 - 100) band in Innovation in the National Institutional Ranking Framework (NIRF) 2023.",
        "NIRF outlines a methodology to rank institutions in India with parameters of Teaching, Learning & Resources, Research and Professional Practice, Graduation Outcome, Outreach & Inclusivity, and Perception.",
        "KPRIET supports students, research scholars, and faculty to invent and innovate engineering to the next level. Our proven teaching method, advanced learning techniques, deep research in engineering and internships for students advanced KPRIET to the new heights",
        "Decided to join Team KPRIET? Explore the current openings at our official linked page",
        "Ready to apply? Signup and apply here",
        "Explore the benefits and recognition that KPRIET offers to its members",
        "Consistently upskilling our students and faculty is a part of KPRIET culture",
        "KPRIET focuses on building a culture of inclusion and diversity for everyone",
        "Our values are the heart of KPRIET. Our values guide us and help what we do",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}