{
    "title": "Centre for Teaching Innovation and Excellence, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Centre for Teaching Innovation and Excellence",
        "Centre for Teaching Innovation and Excellence",
        "The Teaching and Learning Process",
        "About CFTIE",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "",
        "KPRIET has changed the game inside the classroom whether it is online or offline no matter by implementing recent trends and innovative pedagogies such as Student-centered approach to learning, blended learning, eclectic method, flipped classroom, kinesthetic learning, expeditionary learning, inquiry-based learning, and even play way method of learning.",
        "",
        "The faculty members of KPRIET are acting as teachers as well as facilitators in their respective fields. Though technology is used in the teaching and learning process to achieve the epitome of learning it cannot replace the teachers. With passion, they use their approaches and techniques to impart knowledge. They are persistent and determinant in inspiring them to learn and to acquire skills.",
        "Course design is integral in ensuring the content getting delivered to the students. The faculty members of KPRIET have their course plan with the following elements in consideration:",
        "",
        "In the current environment, it is critical for teaching faculty to improve their existing talents, develop new skills, and explore the art, philosophy, and science of teaching so that the teaching and learning process is more pleasurable, creative, and productive for both teachers and students.  There is a pressing need to comprehend the roles of teachers and students so that ICT could be used to facilitate effective teaching and learning, which is critical in today's environment.",
        "KPRIET emphasizes undergraduate teaching and actively promotes a liberal education that is inspired by current teaching and learning research. To formalize support for inspired and innovative pedagogy in the classroom and beyond, in research, scholarship, and creative activity, the institute has established the Centre for Teaching Innovation and Excellence (CFTIE). CFTIE will conduct investigations on innovative teaching pedagogy, gather and share effective teaching and learning techniques from all across the world, and offer intensive teaching workshops and Faculty Development Programs. CFTIE also invites experts from India as well as outside to give lectures on a myriad of subjects.",
        "",
        "Vision",
        "CFTIE strives to offer innovative practices in the teaching-learning process that draw in and motivate students and faculty members in establishing a proportional relationship of learning",
        "",
        "Mission",
        "CFTIE upholds the objectives of KPRIET by giving initiatives and enhancing proof-based instructing and learning practices. CFTIE additionally works to establish and maintain a Learning Management System that will serve as a knowledge repository for the institute’s growth towards being a university",
        "",
        "Activities",
        "Programmes towards development teaching skills for faculty members",
        "Peer-to-peer transfer of  teaching-learning experiences",
        "Support towards development of Teaching Aids",
        "Preparation of e-learning materials",
        "Liasoning of KPRIET-MATLAB Campus-wide License",
        "Research in pedagogy",
        "Integrating ICT into teaching-learning process, etc.",
        "",
        "",
        "As a homegrown product, DON (Data on Net) is a Learning Management System developed on MOODLE platform. Being in its implementation stage, DON has facilitated the conduction of courses common to all departments. DON will see its full-fledged implementation from June of 2022",
        "Open DoN",
        "",
        "",
        "For more details",
        "0422-2635600",
        "head.cftie@kpriet.ac.in",
        "One of the primary goals of CFTIE is to be a repository of knowledge that a modern-day facilitators can turn to whenever they require resources to support their career as an educator. CFTIE has maintained rapport that this office always focuses on the ease of using the resources.",
        "",
        "",
        "",
        "As a homegrown product, DON (Data on Net) is a Learning Management System developed on MOODLE platform. Being in its implementation stage, DON has facilitated the conduction of courses common to all departments. DON will see its full-fledged implementation from June of 2022",
        "Open DoN",
        "",
        ""
    ]
}