{
    "title": "Chemical Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Chemical Engineering is one of the highest growing and high paid career choices of engineering graduates.",
        "The Department was started in the year 2018 with a sanctioned intake of 60 student. The department has experienced substantial growth and attained noteworthy milestones since its inception. Our commitment to academic excellence is reflected in increase in the student enrolment over the years.  Currently serving over 262 students in the undergraduate program, who are actively engaged in a rigorous and comprehensive curriculum designed to meet the demands of the dynamic field of chemical engineering.",
        "At the heart of our success is a team of dedicated and accomplished faculty members and indispensable non-teaching staff who contribute significantly to the overall function of the functionality. The department is proud of its faculty team, comprised of individuals with Ph.D. and Master's degrees in various fields of Chemical Engineering, each bringing a wealth of experience and expertise to the classroom. They are committed to providing students with theoretical knowledge with practical insights, ensuring that our graduates are well-equipped to excel in their chosen careers. Their contributions to publications in journals, research articles and conference presentations highlights the focus of the department on advancing knowledge and contributing to the broader academic and scientific community.",
        "One of the hallmarks of our department is the recognition as a research centre by Anna University, a testament to our dedication to advancing knowledge and contributing to cutting-edge research in the field. This recognition opens up exciting opportunities for both faculty and students to engage in meaningful research that addresses real-world challenges.",
        "As we continue to evolve and grow, we invite you to explore the Department of Chemical Engineering at KPR Institute of Engineering and Technology. Whether you are a prospective student, a current student, a faculty member, or an industry partner, we look forward to engaging with you in our journey of academic excellence and innovation.",
        "Join us as and together we shape the future landscape of chemical engineering!",
        "I'm honoured to lead the Department of Chemical Engineering at KPR Institute of Engineering and Technology (KPRIET). Our educational approach seamlessly integrates theoretical knowledge with hands-on experience across various domains, including Process Engineering, Materials Science, Environmental Engineering, and Biochemical engineering. As the landscape of chemical engineering undergoes transformative changes, our department adapts and expands continuously.",
        "In this age of swift advancement, possessing practical expertise in the latest developments is indispensable. Our commitment goes beyond imparting fundamental principles; we immerse students in the dynamic developments of the field. We empower them with the knowledge and skills necessary in the ever-evolving landscape of chemical engineering.",
        "To be a centre of academic and research excellence in Chemical Engineering to cater to the diverse needs of industry, society and the global community",
        "PEO 1: Apply knowledge of science, and engineering to solve complex Chemical Engineering problems in diverse chemical and allied industries",
        "PEO 2: Design, develop, and optimize chemical processes and products to uphold the needs of society and environment ensuring sustainability",
        "PEO 3: Exhibit a commitment to lifelong learning, research and professional ethics",
        "PO 1. Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
        "PO 2. Problem Analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
        "PO 3. Design and Development of Solutions: Design solution for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
        "PO 5. Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
        "PO 6. Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
        "PO 7. Environment and Sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
        "PO 9. Individual and Team Work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with the society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentation, and give and receive clear instructions.",
        "PO 11. Project Management and Finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and a leader in a team, to manage projects and in multidisciplinary environments.",
        "PO 12. Life Long Learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.",
        "PSO 1: Acquire the necessary knowledge, skill and competence on the principles of Chemical Engineering.",
        "PSO 2: Adopt Chemical Engineering principles with advanced and innovative practices for process and product development.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6(Lateral Entry)",
        "Intake / No. of Seats: 60",
        "The Chemical Engineering department library is a treasure trove of knowledge, encompassing a vast array of essential resources in the field. It houses an extensive collection of books, spanning topics like fluid mechanics, heat transfer, mass transfer, chemical reaction engineering, thermodynamics, process dynamics and control, GATE preparation books and even delves into fundamental subjects such as organic chemistry. This diverse collection equips students with in-depth understanding and insights crucial for their academic and professional pursuits. Moreover, the library subscribes to prominent monthly magazines like \"The Chemical Engineer\" and \"Chemical Engineering Progress,\" ensuring that readers are constantly updated with the latest industry news, research breakthroughs, and case studies. With dedicated study spaces and a wealth of book resources, it stands as a hub of intellectual exploration and academic support, fostering an environment where curiosity thrives and knowledge flourishes.",
        "Who can study B.E in Chemical Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard (intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a Pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in any branch of Engineering and Technology",
        "Industry grade laboratories inside the campus",
        "Chemical Engineering Degree in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what are the opportunities available for a student at KPRIET",
        "Unlock your potential with our B.Tech. Chemical Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}