{
    "title": "CIIED, Centre for Innovation, Incubation and Entrepreneurship Development, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "To be a renowned technology incubation centre to cater to the needs of the society through a sustainable innovation ecosystem.",
        "KPR Institute of Engineering and Technology (KPRIET) is committed to handhold aspiring entrepreneurs and provide facilities and assistance to start, incubate and successfully run businesses that involve innovation, and societally important and environmentally relevant technologies.",
        "KPRIET shall support the incubatees with facilities and services such as office and workspace, communication and computing facilities and uninterrupted power supply, water etc. in addition to offering mentoring, counselling, and training.",
        "KPRIET Shall,",
        "EDC",
        "To create an environment to Young Incubatee and support them to endorse innovative ideas for successful startups",
        "",
        "IIC",
        "To conduct various Innovation, IPR and entrepreneurship-related activities prescribed by  MIC in time bound fashion.",
        "",
        "Startups",
        "It focuses on small businesses (existing and start-up) that have innovative technologies of potential importance to the industry and society",
        "",
        "KInC",
        "KInC has a facility (under 10,000 square feet) it is situated in KPRIET campus to discover, incubate, and accelerate innovative technologies with societal needs",
        "",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}