{
    "title": "B.E. Civil, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Discover Course",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "The demand for skilled Civil Engineers will never slow down worldwide as infrastructure projects, construction of building, and many more structures will keep on increasing and will never be stagnant.",
        "Civil Engineering is one of the major basic branches of engineering. The work ranges from basic concepts related to engineering to the overall development of the nation. A Civil Engineer is responsible for the Planning, Analysis, Designing, and Execution of all construction-related activities. It also includes Cost Estimation, Hydraulic Designs, Soil Engineering, Transportation, Environmental Issues, Surveying, etc. Civil Engineers are often expected to provide the best economic, efficient and eco-friendly designs to serve society inthe best possible ways. This ultimately results in the development of creative solutions to the existing problems in the designs that are designed differently without the budget constraints dictated by modern society. Nowadays, several cutting-edge technologies are available as a part of modern techniques in Civil Engineering to fulfill societal needs which also creates the scope for research and innovations.",
        "Civil Engineers shape the world we live in. They design, build and maintain the infrastructure we take for granted - every reservoir, dam, bridge, road, tunnel and building. Their expertise is key for sustainable future for all over the world.",
        "Civil Engineering is one of the oldest professional engineering disciplinesthat deal with the design, construction, and maintenance of the physical and naturally built environment, including works like roads, bridges, canals, dams, and buildings. It is traditionally broken into several sub-disciplines including Environmental Engineering, Geotechnical Engineering, Structural Engineering, Transportation Engineering, Municipal or Urban Engineering, Water Resources Engineering, Materials Engineering, Coastal Engineering, Surveying, and Construction Engineering. Civil Engineering plays a predominant role in the Public as well as Private Sectors. In the Public Sector, Civil Engineering is required starting from the Municipal agency to the Central Government agencies. Similarly, in the Private sector, it is required from Individual Home Owners to International Companies.",
        "The Construction and Housing sector has become the major growth driver in the Indian Economy. The Civil Engineering department has started as the branch is gaining more importance due to the need of creating structures and buildings resisting earthquakes and other natural calamities. Civil Engineering Department was established in 2009. The department envisages creating world-class civil engineers. The department has highly qualified faculty members with research and industrial experience. The department is equipped with the required infrastructure and state-of-the-art laboratories",
        "If you study Civil Engineering at undergraduate level, you’ll learn to apply mathematics and scientific knowledge (particularly physics) to real-life situations and problems that arise from creating and maintaining structures, taking into account environmental, financial, legal and ethical considerations.",
        "At its core, Civil Engineering is a combination of many scientific specialisms, including mechanics, hydraulics, geotechnics (using knowledge of the earth’s crust to solve construction problems), material science and statistical analysis. As such, study of these foundational elements will feature heavily in the early years of civil engineering degrees.",
        "To develop competent Civil Engineers to create infrastructure with technology in demand that leads to nation building",
        "PEO 1: Graduates will attain adequate knowledge in the core areas of Civil Engineering with good communication and presentation skills and excel in their chosen profession.",
        "PEO 2: Graduates will become successful Civil Engineers by applying their technical and managerial skills and disseminate the knowledge with confidence in various disciplines of Civil Engineering as a responsible citizen.",
        "PEO 3: Graduates will initiate active programmes for lifelong professional achievement and expertise through continuous development.",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "PSO 1: Graduates will be able to design, construct and provide sustainable solutions through consultancy service.",
        "PSO 2: Graduates will be able to execute projects, prepare reports and practice professional licensure.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6 (Lateral Entry)",
        "Intake / No. of Seats: 60",
        "MoU Validity: 3 years",
        "MoU Validity: 1 year",
        "MoU Validity: 2 years",
        "MoU Validity: 3 years",
        "MoU Validity: 5 years",
        "MoU Validity: 3 years",
        "Who can study Electronics and Communication Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "Application Link Click Here",
        "Industry grade laboratories inside the campus",
        "Civil Engineering Degree in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what are the opportunities available for a student at KPRIET",
        "Unlock your potential with our B.E. Civil Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}