{
    "title": "B. Tech. Computer Science and Business Systems, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "B. Tech. Computer Science and Business Systems  (4 Year Undergraduate Engineering Program)",
        "B. Tech. Computer Science and Business Systems",
        "Discover Course",
        "Regulation Details",
        "Program Outcomes (POs)",
        "Curriculum and Syllabi",
        "How will you learn?",
        "Degree Structure",
        "Admission Eligibility",
        "Faculty Member Details",
        "Non Teaching Member Details",
        "Board of Study Members",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "CSBS course was created to meet the growing demand for engineering talent with technology skills. This cutting-edge course aims to provide students with hands-on experience and knowledge of cutting-edge technology and business skills in order to prepare them for the workforce.",
        "CSBS course was created to meet the growing demand for engineering talent with technology skills. This cutting-edge course aims to provide students with hands-on experience and knowledge of cutting-edge technology and business skills in order to prepare them for the workforce.",
        "Computer Science and Business Systems (CSBS) is primarily concerned with computing, algorithm analysis, programming languages, programme design, software engineering, computer hardware, computer networks, and problem resolution.",
        "",
        "Graduates of Compuetr Science and Business Systems department will be able to",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "",
        "This course fosters industry-ready and employable engineers who could innovate and add value to the organization. Students can secure placement in product and service based companies.",
        "The students could avail career opportunities in Government and Public Sectors, Bank and Health Insurance Sectors, Manufacturing and Financial Sectors, Business Analysis and Marketing Sectors.",
        "",
        "Know more about Department of Computer Science and Business Systems at KPR Institute of Engineering and Technology",
        "",
        ""
    ]
}