{
    "title": "Dr. Navamani  K, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "K. Navamani obtained Ph.D. in Physics (2009-2015) from Bharathiar University, Coimbatore, INDIA. During his Ph.D., he investigated charge transport mechanism (including electric field coupled disorder effect) in π-stacked/conjugated organic molecules using electronic structure calculations, based on ab initio and density functional theory (DFT) methods, molecular dynamics (MD) and Monte Carlo (MC) simulations. In his Ph.D. work, he introduced \"density flux model on hopping conductivity\" for disordered molecular solids, disorder-correlated energy dispersion relation, and also he hypothetically modified the diffusion coefficient to examine the forth-back oscillated charge transfer kinetics in the dynamical systems. Then (2015-2016), he subsequently worked as Assistant Professor (contract) at Pondicherry Central University and National Institute of Technology-Karnataka, Surathkal.",
        "After that he joined as a postdoctoral fellow (2016-2020) in the research group of Prof. Swapan K. Pati at Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), Bangalore. In his postdoc period, he proposed multiscale modeling of charge transport on the basis of “3-sets of analytical procedures (1. drift-diffusion analysis, 2. carrier energy-current density relation, 3. physics of deviation in Einstein relation)” for molecular semiconductors, which was examined and verified using DFT methods, MD and MC calculations.",
        "Currently, he is working as Associate Professor at KPR Institute of Engineering and Technology, Coimbatore, INDIA. Recently, he developed \"Entropy-Ruled Method\", which gives three important formalism such as, 1) new version of Einstein’s D/μ Relation for quantum and degenerate systems/devices, 2) Quantum-Classical Transition Analogy (QCTA) for semiconductors and 3) Quantum corrected Shockley diode current density equation (also referred as Navamani-Shockley diode equation).",
        "Young Scientist Award 2021 by VD Good Professional Association, INDIA",
        "Junior Research Fellow (2009-2012), DST Project in the Scheme of Young Scientist, Government of India.",
        "Best Youth Award - 2005 for Science contribution, Yuvakendra Trust (Registered), Madurai, INDIA.",
        "Participated the “Summer Training Programme in Physics” (STPIP-2008) organized by the Tamilnadu Academy of Sciences, Science city and Department of Nuclear Physics, University of Madras (From May 19 to June 14, 2008)",
        "Post-Doctoral Fellow (Oct. 2016 - May 2020),  Supervisor: Prof. Swapan K. Pati, FNA, FASc, FNASc, FTWAS,  Theoretical Sciences Unit,   Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR),  Bangalore-560 064,  INDIA.",
        "Assistant Professor (July, 2016 – Sep. 2016),  National Institute of Technology Karnataka, Surathkal - 575025,  INDIA.",
        "Assistant Professor (Nov. 2015 - May 2016), Pondicherry Central University - 605014,  INDIA.",
        "Ph.D. (Oct. 2009 - Oct. 2015, Full Time-Regular mode), Supervisor: Dr. K. Senthilkumar, Department of Physics, Bharathiar University, Coimbatore - 641046, INDIA.",
        "Dr. K. Navamani (during 2020-21) formulated the diffusion-mobility relation (on the basis of generalized Einstein relation) for universal quantum materials; accordingly he proposed the Navamani-Roichman-Tessler (NRT) diode current density equation for two-dimensional layered systems.",
        "Dr. Navamani (in 2021) proposed the continuum time-delayed hopping model for molecular semiconductors.  Besides that, he mainly has developed the entropy-ruled diffusion-mobility relation to study the validity and limitations of original Einstein relation. According to this method, the Shockley diode equation is modified and is named as Navamani-Shockley diode current density equation. This is the quantum version of molecular transport (J-V) equation.",
        "He developed multiscale modeling of charge transport (on the basis of “three-set of analytical procedures”) and revisiting the Einstein relation for molecular Semiconductors (Ref.: Navamani et al., J. Chem. Phys., 2019, 151, 224301, and Navamani et al., RSC Adv., 2018, 8, 30021).",
        "He hypothetically formulated the diffusion coefficient for forth-back oscillated charge carrier motion in the dynamical molecular systems,  (Ref.: K. Navamani et al., Phys. Chem. Chem. Phys., 2015, 17, 17729).",
        "He proposed “Density Flux Model on Hopping Conductivity Formula” for Disordered Molecular Solids, (Ref.: K. Navamani et al., J. Phys. Chem. C, 2014, 118, 27754).",
        "American Chemical Society",
        "Publications",
        "ORCID",
        "Scopus/Web of Science"
    ]
}