{
    "title": "B.E. Electronics and Communicationse Engineering (ECE), KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "The electronics market of India alone is valued to be nearing $400 billion. Electronics and Communications is the driving force behind the growth and development of many industries.",
        "The Department of Electronics & Communication Engineering was established in 2009 with the primary goal of providing young individuals with the necessary technical knowledge and professional skills to tackle the challenges in the rapidly evolving field of Electronics and Communication Engineering while promoting research in this area. The department offers a Bachelor of Engineering (B.E) Program in Electronics and Communication Engineering, as well as a Master of Engineering (M.E) Program in VLSI design. The B.E-ECE program is accredited by the National Board of Accreditation (NBA), and the department is recognized as a research centre by Anna University.",
        "The department is committed to not only updating the curriculum but also enhancing its laboratory facilities to keep pace with the latest advancements in state-of-the-art technologies. Some notable additions include the Centre for Smart Antenna Systems and Measurements, an industry-driven IoT Centre, and a specialized laboratory for PCB Design and Manufacturing.",
        "The ECE department has a remarkable track record of nurturing students with a strong emphasis on morality, ethics, and culture. It boasts an excellent team of faculty members with strong teaching skills and a focus on research, contributing to the socio-economic development of the field.",
        "At present, the department serves the educational needs of over 600 students across undergraduate, postgraduate, and Ph.D. programs.",
        "To be a centre of excellence for education, research and development in the field of Electronics and Communication Engineering to meet the growing needs of the society.",
        "PEO 1: Apply principles of Electronics and Communication Engineering to provide solutions to the emerging problems in the society.",
        "PEO 2: Embrace technological challenges through skill upgradation or higher education or research.",
        "PEO 3: Exhibit leadership qualities with professional and ethical values.",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "PSO 1: Design, develop and test electronic systems by selecting suitable hardware and software tools.",
        "PSO 2: Identify, design, prototype and implement projects pertaining to modern communication systems.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6(Lateral Entry)",
        "Intake / No. of Seats: 120",
        "25.02.2021",
        "Single Point of Contact:Mr.T.Jagadesh",
        "05.02.2022",
        "Single Point of Contact:Dr.B.Jaishankar",
        "27.01.2022",
        "Single Point of Contact:Dr.R.Jaikumar",
        "18.08.2021",
        "Single Point of Contact:Dr.D.Venugopal",
        "10.03.2021",
        "Single Point of Contact:Mr.K.Saravanan",
        "10.03.2021",
        "Single Point of Contact:Dr.B.Jaishankar",
        "10.04.2023",
        "Single Point of Contact:Dr.B.Jaishankar",
        "Who can study Electronics and Communication Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "Application Link Click Here",
        "Industry grade laboratories inside the campus",
        "Electronics and Communication Engineering Degree in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what are the opportunities available for a student studying ECE",
        "Unlock your potential with our B.E. Electronics and Communication Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}