{
    "title": "B.E. Electrical and Electronics Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "The department of Electrical and Electronics Engineering was started in the year 2009 as one of the core engineering disciplines of the institute. The department offers a UG programme with a sanctioned intake of 60 students. Students have the choice of opting Hons with Specialization and Minor Degree. Currently, the department has also established a research centre recognized by Anna University, Chennai to offer Ph.D. programme. The department has ten well‑equipped laboratories and four Centre of Excellence, covering a wide range of areas in the field of EE. Some of the best teaching practices include peer to peer learning, use of ICT tools, flipped classroom and project-based learning. A total of 26 faculties serves the department including 16 Ph.D. holders. MoUs with leading industries such as ABB, Virtusa, EKKI are some of the highlights of the department. Some of our top recruiters are Schneider Electric, L&T, VVDN, Tech Mahindra and Ivymobility and TESSOLVE.",
        "The Department of Electrical and Electronics Engineering extends its focus beyond innovation to shaping future engineers in alignment with India's National Education Policy. By integrating cutting-edge technologies, such as electric vehicles and renewable energy, into the curriculum, the department ensures that students not only grasp theoretical concepts but also engage with practical applications. This approach not only fosters a deep understanding of electrical engineering but also prepares students to address contemporary challenges. In this educational journey, our leadership steers not only academic excellence but also the application of knowledge to build a brighter, more sustainable India.",
        "To be a premier centre for quality education, innovation and research in the field of Electrical and Electronics Engineering to meet the global challenges with professional ethics and social consciousness.",
        "PEO 1: Apply the acquired knowledge and skills to meet the emerging needs of the society and also excel in their chosen profession",
        "PEO 2: Adapt to emerging technologies and continuously upskill through active research in Electrical Engineering and allied areas",
        "PEO 3: Demonstrate leadership skills and practice their profession conforming to ethical and human values",
        "PO 1. Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
        "PO 2. Problem Analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
        "PO 3. Design and Development of Solutions: Design solution for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
        "PO 5. Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
        "PO 6. Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
        "PO 7. Environment and Sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
        "PO 9. Individual and Team Work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with the society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentation, and give and receive clear instructions.",
        "PO 11. Project Management and Finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and a leader in a team, to manage projects and in multidisciplinary environments.",
        "PO 12. Life Long Learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.",
        "PSO 1: Analyse, design and test power electronic components integrated with computer-based systems to meet industrial and societal needs",
        "PSO 2: Deploy modern engineering tools to model, simulate, fabricate and integrate electrical systems with renewable energy to enhance sustainability",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6(Lateral Entry)",
        "Intake / No. of Seats: 60",
        "Who can study B.E in Electrical and Electronics Engineering at KPR Institute of Engineering and Technology",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "Application Link Click Here",
        "Industry grade laboratories inside the campus",
        "Electrical and Electronics Engineering Degree in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what opportunities are available for a student at KPRIET",
        "Unlock your potential with our B.E. Electrical and Electronics Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}