{
    "title": "KPR Institute of Engineering and Technology",
    "headings": [
        "Why choose KPRIET?",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "",
        "A Pass with minimum average marks in Physics, Chemistry and Mathematics put together for the different categories as follows:",
        "As the candidates from other states are considered as General Category, a Pass with minimum average marks in Physics, Chemistry and Mathematics put together for General Category is 45%",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "A Pass with minimum average marks in Theory, Practical and Mathematics put together for the different categories as follows:",
        "As the candidates from other states are considered as General Category, a Pass with minimum average marks in Physics, Chemistry and Mathematics put together for General Category is 45%",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "a) A pass in a recognised Bachelor’s Degree or equivalent in the relevant field and obtained at least 50% (45% in the case of candidates belonging to reserved category) in the qualifying degree examination",
        "b) 10 + 2 years + AMIE (or) 10 + 3 years diploma (awarded by the State Board of Technical Education) + AMIE.",
        "Welcome to KPRIET",
        "Our curriculum is co-designed with industry to align with the industry trends. Its designed to gain the practical skills needed to succeed in future.",
        "Our students are not just though to excel in academics, but also in solving real world challenges. We have over 85+ patents filed by our students and staffs.",
        "We are committed to make our students excel in life and career. With multiple value added courses and campus facilities, students are ready for the life, not just for job."
    ]
}