{
    "title": "Facilities, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Facilities",
        "Facilities",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Facilities at KPRIET Campus",
        "With a 150-acre clean and green campus, KPRIET provides a welcoming and quiet environment that makes campus life wholesome and complete. It is a vibrant campus with academic and research facilities, hostel blocks, sports complex, and other amenities for about 5000 students and approximately 500 faculty and staff. KPRIET strives to provide the greatest available facilities so that our students can benefit from a modern learning environment while also enjoying their education. With the comfort and welfare of students in mind, we provide enough facilities necessary for the individual subject areas taught.",
        "The Hostels in KPRIET play a very significant role in pursuing academic, cultural and recreational activities. While developing Hostel facilities without having any mind set, it will be our endeavor to follow the well-established ethos and a healthy community atmosphere in the Hostel.",
        "KPRIET offers a safe and secure bus service that picks up and drops off all of our students at pre-determined times and locations. We have our own fleet of 20 buses that are built to government standards and driven by highly trained and experienced drivers. All of our buses are equipped with GPS systems, which allow us to follow their location.",
        "Central Library acts as the main learning resource centre of the Institute. It has been providing up to date and nascent information resources and services both in hard and soft forms to the academic and administrative communities’ since 2009. Moreover, it has become an indispensable learning resource centre for students, researchers and faculty members.",
        "KPR Institute of Engineering and Technology has excellent state-of-the-art infrastructure for sports and provides professional coaching in sports to students. KPRIET has a newly constructed indoor auditorium for shuttle badminton. In addition to this, the KPRIET has the following facilities"
    ]
}