{
    "title": "Industry Institute Partnership Cell (IIPC), KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Industry Institute Partnership Cell",
        "Industry Institute Partnership Cell",
        "Having a question in mind?",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Industry Institute Partnership Cell is established for bridging the gap between the institute and industry and to promote industry interaction in various dimensions of academics. IIP cell focus on identifying the industrial needs and to prepare the students with potential skills required by the industry. The cell facilitates  student community to undergo internship’s at IIT’s, NIT’s, MNC’s and other core companies. The cell also supports faculty members to acquire consultancy services based on the requirement from the industry",
        "Brochure",
        "Centre of Excellence",
        "",
        "Objective",
        "To foster close interaction with industrial partners, professional associations and professional bodies, the stakeholders of the institution, to receive inputs for academic, research and innovation, entrepreneurship and social responsibilities towards providing quality education, creative and innovative solutions for societal problems and opportunities for sustainable growth.",
        "",
        "Activities",
        "Arrange industrial visits",
        "Strengthen industrial training for students and faculty",
        "Indulge collaborative industrial projects",
        "Promote consultancy services",
        "Conduct executive development program",
        "Arrange guest lectures by industry experts",
        "Signed an MoU with the Roots Industries & Siemens and collaborate with it for activities like internship training and guest lectures. As a Token of Gratitude Ford India confirmed to give us a Ford Eco sport car (Pre Build Test Unit) for learning purpose as a part of its CSR Initiative.",
        "With our continuous effort during the last two years, we got job opportunities and Internship trainings in companies like KYB Suspension India Limited, Ampo Valves, Siemens, EKKI Pumps, Mahendra Pumps, PEPS, Maarks Engineering.",
        "PCB design and fabrication, Embedded and lot for industrial automation, Signal & Image processing based automation",
        "Energy Auditing, Power Electronics and Drives, Power Systems Engineering & Embedded Systems with loT",
        "As an Industry Driven Institute it is also active in conducting various programs through filed visits and workshops. The thrust areas of consultancies includes water testing, soil testing, concrete cube testing and hydraulic works.",
        "Biomedical signal acquisition and processing, Biomedical posture analysis, Bio analysis using ELISA",
        "Separation Technologies and Water Management, Process Plant Equipment Design Material Technology and Metallurgy, Biochemical Engineering",
        "Internet of things Web Design & Mobile App Development Artificial Intelligence Machine Learning and Deep Learning",
        "Get answers to any questions you have about our programs, applications and more.",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}