{
    "title": "International Admissions, KPRIET, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "KPR Institute of Engineering and Technology has a separate well established KPR International Centre (KIC) to take care of every single need of the Foreign Nationals on campus starting from their admission to day-to-day activities till reaching them safely at home on successful completion of their studies. The Director of KIC has nearly 20 years of experience in handling foreign students from more than 20 countries, admitted under the Foreign National / Children of Indian Workers in Gulf Countries/PIO quota with a special approval from All India Council for Technical Education (AICTE). Separate International Students Welfare Officer, International Students Co-ordinator and Staff Counselors take special care of the Foreign Nationals. KPRIET, with its reputation, recognition and the cross-cultural flavour, is now emerging as a leading educational destination for international students across the globe. The KPR International Centre has the responsibility of the recruitment of the international students through various promotional activities like participation in International Education Exhibitions, coordinating with the foreign ministries of education & Indian Embassies abroad, signing MoU’s with the recruitment agencies and service providers. Also, the cell takes care of the welfare of the international students all through the course of their study. Foreign Nationals - No. of Seats Available (Foreign Nationals / Persons of Indian origin/ Children of Indian workers in Gulf countries)",
        "(Foreign Nationals / Persons of Indian origin / Children of Indian workers in Gulf countries)",
        "Post Graduate Degree: M.E. / M.Tech.",
        "Eligibility Admission Criteria",
        "Minimum Marks",
        "Candidate should have studied in English Medium / as one of the subjects in the qualifying Exam",
        "Category: FN / PIO / Children of Indian workers in gulf countries",
        "Marks %: 50%",
        "Remarks : 50% each in Mathematics, Physics & Chemistry",
        "For admission to B.E./B.Tech. Courses, candidates to have completed 12 years of schooling (equivalent to 10+2 system of Indian Education). Must have studied and obtained a pass with Good Grades as per their systems of education with Physics, Chemistry and Mathematics as one of their subjects in the qualifying examination.",
        "The following qualifications are considered equivalent to 10+2 system of Indian Education.",
        "Visa Requirements",
        "Candidates who are admitted under this scheme must obtain valid student visa issued by Indian missions abroad endorsed in the name of KPR Institute of Engineering and Technology, Coimbatore.",
        "Fitness",
        "Candidates offered admission by our College have to submit a medical fitness certificate in the prescribed format (Annexure II).",
        "Payment of Tuition Fee",
        "On receipt of the admission letter the candidate has to pay the prescribed fee as indicated in the admission letter.",
        "Hostel / Residential Accommodations",
        "Hostel accommodation is available inside the campus. Interested Candidates may apply to The International Affairs Division / Deputy Warden of KPRIET Hostel for accommodation. They have to pay the prescribed fee as per hostel rules. Separate blocks in the existing hostels are available for foreign students. The hostel mess (vegetarian/ Non-Veg) is run separately for the International students.",
        "The degree that teaches you a global perspective on the big issues",
        "Our teaching is industry-informed, our research is inventive and adventurous. We create knowledge that is central to global economic and social prosperity. Our graduates are the new professionals, global citizens at ease with the world and ready to create and respond to change."
    ]
}