{
    "title": "Central Library, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Central Library acts as the main learning resource centre of the Institute. It has been providing up to date and nascent information resources and services both in hard and soft forms to the academic and administrative communities' since 2009. Moreover, it has become an indispensable learning resource centre for students, researchers and faculty members.",
        "The Library has over the years built a robust collection of over 40000 books, 124 current subscriptions to print journals, magazines, newspapers, and many other resources. The Central Library offers its users the convenient access to the best of Engineering subject related digital resources through its subscription to e-databases in which more than 300 e-journals, 100 plus e-books from Pearson and McGraw-Hill with concurrent usage, consisting of scholarly contents round the clock all across the campus via Wi-Fi network.",
        "",
        "Vision",
        "To provide a world-class knowledge resource that not only caters the curriculum requirement but also promotes intellectual enquiry and research",
        "",
        "Mission",
        "To achieve this through superior quality service with consistence. We focus on values like quality, utility, accessibility and stability",
        "Books: The library has successfully built up a comprehensive collection of over 27227 books covering different branches of knowledge, Besides, there are also more than 1900 eBooks available in electronic form covering varied subjects",
        "Journals & Electronics Resources: The library subscribes to 127 print periodicals (both Indian and Foreign) specific to the academic and research needs of the academic community of the college. There are more than 309 electronic Journals through the online databases subscribed by the library. There are more than 100 bound volumes of Journals in the library.",
        "Videos: 9300 NPTEL videos are available for academic and online exam purpose.",
        "CD-ROMS: The library has 1150 CDs/DVDs on Books, TOEFL, IELTS, Gate, encyclopedias, dictionaries, etc.",
        "Magazines & News Papers: The library subscribes to 27 Magazines and 11 newspapers with multiple copies to cater to the needs of the students and academic community.",
        "Other Resources: The Library also holds a collection 745 of students Project reports, more than 2000 book bank books in all subjects areas being taught at the college.",
        "Distribution of Books and Periodicals are given below:",
        "Borrowing Entitlement",
        "OPAC",
        "KPR Library has gone online within the KPRnet (KPR Intranet).",
        "OPAC (Online Public Access Catalogue) facility is now available at the library entrance to facilitate online search of books available in the library with Title, Author, Keyword and Subject search options.",
        "http://172.20.200.216:8181/erpoperations/opac.aspx/",
        "http://erp.kpriet.ac.in:8181/erpoperations/opac.aspx/",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}