{
    "title": "B.E. Mechanical Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Employment of mechanical engineers is projected to grow 9 percent from 2016 to 2026, as fast as the average for all occupations.",
        "The Mechanical department began in 2009 with 60 students in its undergraduate program. In 2014, we introduced a Master's program in CAD/CAM, starting with 18 students. Our department is also a recognized research center under Anna University, supporting over 40 research scholars in various fields. Currently, we serve over 400 students across undergraduate, postgraduate, and Ph.D. programs.",
        "In just ten years, our department has achieved many milestones. We now have about 30 faculty members, expertise in different areas of mechanical engineering. Around 60% of the faculty have completed Ph.D. degrees, and others are pursuing Ph.D. We are proud that two faculty members have completed postdoctoral fellowships at international universities. Our faculty contribute through publications in journals, research articles, and conference presentations. Three of our faculty members are listed in top 2% scientist in their respective domain assessed by Stanford University USA and Elsevier publisher.",
        "Welcome to the Mechanical Engineering, KPR Institute of Engineering and Technology",
        "Established in 2009, the department has rapidly carved a position in the annals of engineering excellence. As the Head of the Department, I am honoured to represent a community of dynamic innovators, dedicated educators, and passionate students.",
        "Mechanical Engineering has stood long at the crossroads of technological advancement, and consistently delivers solutions to both contemporary and future challenges.",
        "It is with immense pride that I highlight few of our faculty members being recognized as among the world's top 2% scientists by Stanford University for three consecutive years - 2021, 2022, and 2023. This accolade is a testament to our commitment and our desire to be at the forefront of global research.",
        "Students are the lifeblood of the department and have showcased their prowess by competing and excelling at both national and international levels. Their achievements in esteemed competitions such as the International Quality Convention, SAE BAJA, ESVC, Efficycle, Gokart, and Dirt Bike Competitions reflect the caliber of talent nurtured within our walls.",
        "In our pursuit of holistic education, the department offers specialized training in areas like Design and Automation, Material Science, Advanced manufacturing, Motorsports, Electric Vehicles, and 3D Printing. Moreover, we pride ourselves on the robust industry ecosystem. This ecosystem not only enhances the curriculum but also ensures that the students receive top-tier training, valuable internships, and promising placement opportunities.",
        "To be recognized as a premier centre in the field of mechanical engineering education, research and development to meet the changing needs of industry and society",
        "PEO 1: Excel in their professional career with competencies in the field of Mechanical and Allied Engineering",
        "PEO 2: Apply modern research and simulation tools to solve industrial and societal needs",
        "PEO 3: Practice professional and ethical values in their respective organizations and society",
        "PO 1. Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
        "PO 2. Problem Analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
        "PO 3. Design and Development of Solutions: Design solution for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
        "PO 5. Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
        "PO 6. Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
        "PO 7. Environment and Sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
        "PO 9. Individual and Team Work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with the society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentation, and give and receive clear instructions.",
        "PO 11. Project Management and Finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and a leader in a team, to manage projects and in multidisciplinary environments.",
        "PO 12. Life Long Learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.",
        "PSO 1: Design, develop and implement advanced mechanical systems by applying engineering principles for improved performance and less human effort.",
        "PSO 2: Apply quality tools to ensure quality, articulate maintenance principles and demonstrate managerial skills to comprehend the mechanical engineering processes and services.",
        "Duration: 4 years (Regular) / 3 Years (Lateral Entry)",
        "No. of Semesters: 8 (Regular) / 6(Lateral Entry)",
        "Intake / No. of Seats: 60",
        "Mechanical Engineering department is a recognized research Center by Anna University Chennai for doing Ph.D.",
        "Industry grade laboratories inside the campus",
        "Mechanical Engineering Degree in India is a Internationally recognized degree",
        "Curriculum is designed at par with International Standards",
        "Download the strategy document to understand what are the opportunities available for a student at KPRIET",
        "Unlock your potential with our B.E. Electrical and Electronics Engineering Course. Exceptional Academic Performance, Small classes and personalized attention, Affordable tuition, Amazing campus."
    ]
}