{
    "title": "B.E. Mechatronics Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Vision, Mission & PEOs",
        "POs & PSOs",
        "Board of Studies",
        "Regulation Details",
        "Curriculum and Syllabi",
        "How will you learn?",
        "Degree Structure",
        "Admission Eligibility",
        "Faculty Member Details",
        "Professor of Practice",
        "Non Teaching Member Details",
        "Board of Study Members",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Mechatronics engineering technologists use a combination of mechanical, electrical, computer and software skills to work with smart technologies, such as robots, automated guided systems and computer-integrated manufacturing equipment.",
        "The department of Mechatronics Engineering was started in the year 2022 as one of the core engineering disciplines of the institute. The department at KPRIET offers undergraduate B.E program in Mechatronics Engineering, providing students with a comprehensive understanding of robotics, automation, control systems, sensors, and other relevant technologies. The curriculum includes theoretical knowledge as well as hands-on experience through laboratory work, projects, and internships with industry collaborations. Students studying in the Department of Mechatronics Engineering will gain a strong foundation in engineering principles along with specialized knowledge in mechatronics. They have access to state-of-the-art facilities and equipment to support their learning and research activities. The department focus on research and development in areas such as autonomous systems, robotics and automation, embedded systems, and mechatronic product design. Faculty members are be experts in their respective fields, contributing to both academic and industrial advancements through their research endeavours.",
        "Overall, the Department of Mechatronics Engineering at KPRIET provides students with a comprehensive education and practical skills to excel in the rapidly evolving field of mechatronics and contribute to technological innovations.",
        "I am delighted to welcome you to the Department of Mechatronics Engineering at KPR Institute of Engineering and Technology. As the Head of Department, it is my privilege to lead a team of dedicated faculty members and enthusiastic students in exploring the exciting realm of Mechatronics. Our department is committed to providing a comprehensive education that combines theoretical knowledge with practical hands-on experience. Through our rigorous curriculum, state-of-the-art laboratories and Centre of Excellence, and industry collaborations, we aim to equip our students with the skills and expertise needed to excel in today's dynamic technological Industry 4.0 landscape.",
        "To be a transdisciplinary department for the development of academic excellence and research in the field of Mechatronics, catering to the needs of the Industry and the Society.",
        "PEO 1: The graduates of Mechatronics Engineering will possess adequate knowledge and skill to succeed in their professional career.",
        "PEO 2: The graduates of Mechatronics Engineering will analyse, design and develop a transdisciplinary engineering-based products and processes for real world applications",
        "PEO 3: The graduates of Mechatronics Engineering will practise their profession with good ethical and human values",
        "PO 1. Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems",
        "PO 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences",
        "PO 3. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations",
        "PO 4. Conduct investigations of complex problems: Use research-based knowledge and research methodsincluding design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions",
        "PO 5. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations",
        "PO 6. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice",
        "PO 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development",
        "PO 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice",
        "PO 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings",
        "PO 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions",
        "PO 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one's own work, as a member and leader in a team, to manage projects and in multidisciplinary environments",
        "PO 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change",
        "PSO 1: Graduates will be able to apply the gained knowledge and skills to design, develop and implement mechatronics systems in fields of engineering and sciences.",
        "PSO 2: Graduates will be able to apply innovative ideas and multidisciplinary approaches to solve real world problems.",
        "The candidates must have passed the 12th standard(intermediate) or its equivalent examination from the Government recognized board with the subjects as Physics, Chemistry and Mathematics with the percentage as 45% (for general candidates), 40% (for backward class including Muslim), 40% (MBC & DNC) and 40% (for SC/ST/SCA) candidates.",
        "As the candidates from other states are considered under General Category, a pass with minimum average marks in Physics, Chemistry and Mathematics put together as 45% (General Category)",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together as in General Category",
        "The candidate should have passed in all the subjects and scored a minimum average of 45% in Physics, Chemistry and Mathematics put together",
        "Passed Diploma examination with at least 45% marks (40% marks in case of candidates belonging to reserved category) in ANY branch of Engineering and Technology",
        "",
        "B.E. Mechatronics Engineering makes the student to gain high level computing knowledge along with a deep knowledge in mechatronics engineering. Students will get an opportunity to pursue their career as an AI professional in the emerging area.",
        "Job titles for Mechatronics Engineering students are very diverse, and may include, AI Engineer, Data Scientist, Business Intelligence Strategist, Research Scientist, Data Mining Engineer, Machine Learning Engineer Etc.,",
        "",
        "Know more about Department of Mechatronics Engineering at KPR Institute of Engineering and Technology",
        ""
    ]
}