{
    "title": "KPR Institute of Engineering and Technology",
    "headings": [
        "What would you like to study?",
        "PG Programmes",
        "Ph.D. Programmes",
        "Why choose KPRIET?",
        "Other ways to study",
        "More information for",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "",
        "At KPR Institute of Engineering and Technology, it’s all about you. Study the subject you love at KPRIET we’ll help you realise your dreams. Search for your favourite subject or talk to us, we will help you find one.",
        "Admissions to all P.G. courses (M.E)in all affiliated colleges are administered by Anna University, Chennai. Further details on this are available at www.annauniv.edu.",
        "Name of the Degree: Master of Engineering",
        "Duration: Two Years",
        "Institute offers the following degree programs. The Syllabi and scheme of examination for these courses are as prescribed by ANNA University, Chennai.",
        "Our curriculum is co-designed with industry to align with the industry trends. Its designed to gain the practical skills needed to succeed in future.",
        "Our students are not just though to excel in academics, but also in solving real world challenges. We have over 85+ patents filed by our students and staffs.",
        "We are committed to make our students excel in life and career. With multiple value added courses and campus facilities, students are ready for the life, not just for job.",
        "The curriculum is designed in such a way that it provides freedom to the students to choose courses from a list of departmental electives. In addition, the students can opt for three/four courses as open electives from a large pool of courses offered by other disciplines.",
        "This facilitates students to register for additional courses in order to satisfy their credit requirements through course works enabling them to devote the entire eighth semester for a quality project work in Industry.",
        "Students are free to choose their project team mates and supervisors from any discipline to carry out interdisciplinary projects",
        "Students have an option to register for value–added certificate courses, which are offered beyond the regular working hours.",
        "Students also can opt for Entrepreneurship track courses, Industry oriented courses, Online courses, Liberal Arts courses.",
        "Institute provides freedom to introduce new courses as electives/value added courses in tune with the latest developments.",
        "Apart form Engineering Degrees, multiple short courses are taught in state-of-the-art facilities.",
        "We have many upcoming events that are open to public. Look what is suitable for you and register it.",
        "View interesting science and tech videos, and podcast from our students and staffs online.",
        "Find everything about applying to KPRIET, Hostels, Transport, Campus Facilites Etc., Learn about the life at KPRIET.",
        "Find information about our academic Standards, career records, safety measures, our recognition and awards",
        "Find out everything you need to know about applying to KPRIET and see experiences of International students at KPRIET",
        "Welcome to KPRIET"
    ]
}