{
    "title": "KPR Institute of Engineering and Technology",
    "headings": [
        "Phishing",
        "Phishing",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "What is Phishing?",
        "Phishing is usually an attempt to deceive you into thinking a legitimate organization is requesting\n                                            information from you. These requests for information may look innocent at first glance or may seem to\n                                            come from a legitimate source, but they do not. These scams request you reply to an email, respond to a\n                                            request by phone, or follow a link to a web site.",
        "Email phishing attempts often give clear indications that the request is not legitimate and we will show\n                                            you some examples on this page. Links to web sites (sent to you through email) often take you to web\n                                            pages that look very similar to the legitimate service the email is faking. Banks and online e-cash services\n                                            are common targets; however, phishing attempts are sometimes targeted against specific groups or lists\n                                            of individuals and are called ‘spear phishing.’",
        "What does a Phishing email look like?",
        "Phishing emails often attempt to use emotional triggers to get you to react quickly without thinking\n                                            through whether you should respond, such as dire language about time limits, loss of service, penalties,\n                                            or language targeting a desire for money. They often have grammar, spelling, and syntax errors and\n                                            phrasing that a native speaker would not use.",
        "An example would be an email with a generic greeting warning of a change in an account requiring you to\n                                            verify your account information. These emails typically include directions to reply with private\n                                            information, or provide a link to a web site to verify your account by providing personal information such\n                                            as name, address, bank account number, Aadhaar number, or other sensitive personal information.",
        "Indicators of a phishing email:",
        "How to avoid phishing scams?",
        "Report phishing",
        "We are aware of scam emails circulated earlier, claiming authoritative person from KPRIET. If you doubt\n                                            the authenticity of any type of correspondence claiming to originate from KPR Institute of Engineering\n                                            and Technology, please email phishing@kpriet.ac.in. This alerts the support team of KPRIET to the\n                                            potential scam and allows for it to be investigated and remedied, if necessary. Please note: Due to the\n                                            volume of inquiries we receive, we cannot respond to every request.",
        "The institute is aware of varied forms of fraudulent correspondence including, but not limited to: email,\n                                            postal mail, fax, and telephone, all claiming to be from, or associated with KPRIET. They are circulating\n                                            which include institution logo, photos, links, or other information taken directly from our official web site,\n                                            www.kpriet.ac.in.",
        "Unfortunately, scams claiming to be from or associated with the institute are growing in volume and, in\n                                            many cases, can be quite sophisticated. Our support team is working with law enforcement to make every\n                                            effort to stop such scams, but unfortunately, we cannot stop them all.",
        "Please be advised that the institution, management, heads of departments or employees do not:",
        "For more information about the KPRIET efforts against these kinds of fraudulence or filing a complaint,\n                                            please mail to: phishing@kpriet.ac.in",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}