{
    "title": "KPR Institute of Engineering and Technology",
    "headings": [
        "Privacy Policy",
        "Privacy Policy",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "KPR Institute of Engineering and Technology  is committed to protecting your privacy",
        "The following privacy notice describes what information we collect from you when you visit KPRIET and affiliated sites, and how we use this information from those sites. Please read this privacy notice carefully so that you understand our privacy practices.",
        "EFFECTIVE DATE OF PRIVACY NOTICE : The privacy notice was last revised on Oct 17, 2020.",
        "WHAT INFORMATION WE GATHER DURING YOUR VISIT",
        "Information we gather:",
        "We automatically collect certain information from you when you visit our websites. This data is used in conjunction with Google Analytics to gather metrics on site usage including geographic location of visitors, pathways navigated through our websites, and which portion of our audience is internal to the KPRIET  network. The information we collect with Google Analytics is not linked to anything that identifies you as an individual. Your session will be tracked but you will remain anonymous as a user. As part of Google Analytics, we also gather device and browser-related information.",
        "Information you may provide:",
        "The following information may be collected from you, depending on how you choose to interact with our websites, programs, and other services. Some of the information we ask you to provide may be required for our programs and services; other information may be voluntarily provided.",
        "Contact Information: name, physical address, country, province, phone number, email address, emergency contact information.",
        "Employment Information:  company name, address, phone, fax, email, website, description, parent organization, union membership status, position/title, years in job, responsibilities, position you report to, next step in career path, previous positions, employers and years, resume (file-upload).",
        "Professional Business Analysis Tools: (very specific information on your business including but not limited to:) business name, address, type, size (sq. ft.), number of employees, titles, positions, wages, cost of running business, seating and table data for restaurants, data related to hire / replace employees.",
        "HOW WE USE YOUR INFORMATION",
        "We use automatically gathered information to track user trends and site usage with the goal of improving our visitors’ experience and optimizing our websites. We also use the information to administer the websites and prevent abuse.",
        "Information you provide to us is used for the following purposes:",
        "WITH WHOM WE SHARE YOUR INFORMATION",
        "Information we gather may also be shared with KPRIET constituents to improve programs, outreach, and other campus initiatives. Additionally, metrics may be shared with vendors to improve communications related to these activities. However, we will not sell this data to third-parties for their use in direct marketing, advertising, or for the promotion of their products and services.",
        "COOKIES AND OTHER COLLECTION TECHNOLOGIES",
        "Cookies",
        "Cookies are text files stored on your computer and accessible only to the websites which create them",
        "Our websites may use cookies to keep you logged into secure areas of the website and/or to keep track of your preferences as you interact with certain services. You may disable cookies in your browser, however, our websites may not work properly if you do so.",
        "Log Files",
        "Our websites automatically gather anonymous information about our visitors including IP addresses, browser types, and the times and dates of webpage visits. The information collected does not include any personally identifiable details and is used to improve our services and administer our websites.",
        "PROTECTING YOUR INFORMATION",
        "No method of transmitting over the internet or storing electronic data is 100% secure, but this site has measures in place to help protect against the loss, misuse, or alteration of the information that is under our control.",
        "Email Marketing",
        "We use email marketing platforms to communicate with audiences such as prospective students, event attendees, enrolled students, staff and faculty members, alumni, and corporate sponsors. All emails sent from these platforms include the physical address of the office sending the email, and a functioning unsubscribe or opt-out link. You may also contact the Office of Marketing and Communications directly (see the “Contact” section below) to opt-out or provide feedback on any email marketing campaigns.",
        "Social Media Presence",
        "If you share our content through social media, such as liking us on Facebook, interacting with us on LinkedIn or Instagram, or tweeting about us on Twitter, those social networks will record that you have done so and may set a cookie for this purpose.",
        "If you wish to opt-out of any of these social interactions please refer to the specific social media platform for instructions on how to do so.",
        "External Website Links",
        "From time-to-time, we will link to external websites that we neither own nor control. Cornell University is not responsible for the content, privacy practices, or web accessibility needs on these websites",
        "CONTACT INFORMATION",
        "If you have questions about our privacy notice or the privacy practices it describes, please contact: privacy@kpriet.ac.in",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}