{
    "title": "Professional Societies, Indian Institute of Chemical Engineers, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Students can participate in professional societies at KPR Institute of Engineering and Technology. Its a great way to network and learn from peers and others involved in 21st century engineering and education.",
        "To ensure a clean environment for future generations by enabling transformative mobility solutions.",
        "To be an academic institution in dynamic equilibrium with its social, ecological and economic environment striving continuously for excellence in education, research and technological to the nation.",
        "Connect with a global network of intelligent, resourceful colleagues and their shared wisdom. Move forward professionally with AIChE and enrich the world we live in.",
        "A student organization that reinforces the life of civil engineering students through technical events and industrial interactions.",
        "The Biomedical Engineering Society of India (BMESI) is an All India, non-profit making professional learned body.",
        "Computer Society of India (CSI) is the first and largest body of computer professionals in India.",
        "IEI has been recognized as Scientific and Industrial Research Organization by the Ministry of Science & Technology, Govt. of India.",
        "Indian Concrete Institute is one of the leading professional bodies in India, catering to the professional needs of individuals and organisations involved in Concrete.",
        "To provide a platform for students to develop their technical, leadership, and communication skills, and to foster a lifelong passion for chemical engineering.",
        "IGS - Indian Geotechnical Society Is A Top Most Civil Engineering & Geotechnical Society In India.",
        "IWS is promoting the advancement of Welding, Cutting, Reclamation, Hard Facing and related technologies and other allied sciences which the Society may decide from time to time.",
        "The Indian Society of Heating, Refrigerating and Air Conditioning Engineers (ISHRAE), was founded in 1981 at New Delhi by a group of eminent HVAC&R professionals.",
        "Indian Biomedical Skill Council aims at strengthening the Biomedical Skill Sector in the country and with this objective develop job roles and approved by National Skill Development Agency (NSDA).",
        "The Institution of Electronics and Telecommunication Engineers is India's leading recognised professional society devoted to the advancement of Science and Technology of Electronics, Telecommunication & IT.",
        "IEEE is the world’s largest technical professional organization dedicated to advancing technology for the benefit of humanity.",
        "ISTE is the world’s largest technical professional organization dedicated to advancing technology for the benefit of humanity.",
        "The largest Network of Teachers of English in India (An Associate of IATEFL, UK )The English Language Teachers’ Association of India (ELTAI).",
        "promote education, research, training and development to Indian foundrymen...",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}