{
    "title": "Top 2% Scientist - 2023, Research, CFRD, Centre for Research and Development, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "BIOMEDICAL ENGINEERING",
        "CHEMICAL ENGINEERING",
        "CIVIL ENGINEERING",
        "COMPUTER SCIENCE AND ENGINEERING",
        "ELECTRONICS AND COMMUNICATION ENGINEERING",
        "ELECTRICAL AND ELECTRONICS ENGINEERING",
        "MECHANICAL ENGINEERING",
        "PHYSICS",
        "CHEMISTRY",
        "MATHEMATICS",
        "Is financial assistance available?",
        "What is Teaching assistantship?",
        "What is Research assistantship?",
        "Do you have any special research assistantships?",
        "Is part time students eligible for assistantships and scholarships?",
        "Is stipend available? What are my responsibilities?",
        "Is there an interview process? How much will i get paid?",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "KPR Institute of Engineering and Technology is committed to the pursuit of excellence in research and aiming to lead the national agenda across the spectrum of science and technology. We ensure all the core and inter disciplinary areas in research by approving the highest norms and standards.",
        "Centre for Research and Development is a state-of-the-art facilitation centre to promote research in cutting edge technologies and develop tools, gadgets, methodologies and techniques to cater the needs of industry in specific and society at large.",
        "The teaching/research assistantship carries with it a stipend, but also has responsibilities for some academic work. The assistantship has three components:",
        "Scholarship: This part of the assistantship is for good scholarship and will be continued as long as the student maintains defined academic performance (and remains a full-time student).",
        "The financial support continuation shall be contingent upon the performance in academics and the assigned academic/administrative duties and will be reviewed every semester"
    ]
}