{
    "title": "Sangamam (An Echoing Symphony), KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "An Echoing Symphony",
        "Faculty Coordinators",
        "Student Coordinators",
        "Office Bearers",
        "Newsletters",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "",
        "The Unity of arts is an enabler of all the initiatives. The Team is a manifestation of 19 clubs to bring out the real potential of our students and to enrich their skills. During the Covid-19 pandemic situation, KPR Institute of Engineering and Technology inaugurated the grand Sangamam for conducting online webinars and various types of cultural and educational events for school and college students. E-certificates are provided for both the internal and external participants as a token of appreciation",
        "",
        "Vision",
        "To identify and nourish the talents of diverse nature, provide a conducive environment for showcasing potentials and to enhance the creative ability of the young minds for professional and personal growth.",
        "",
        "Mission",
        "",
        "Short Term Goals",
        "",
        "Long Term Goals",
        "BREAK THE BARRIER AND SHOWCASE YOUR SKILLS",
        "",
        "",
        "Sasikumar Pandian, the President of Team Sangamam, had a journey that began as a member of the Naanal Eco Club, where he learned team-leading skills. He then transitioned to Sangamam as an event coordinator, acquiring team management skills and coordinating numerous events. In the following year, he was appointed as the Vice President, further honing his ability to work with a team.",
        "Throughout this journey, he experienced days when valuable lessons were learned, shaping him into the leader he is today. As a team, he achieved many milestones, and he looks forward to continuing this journey.",
        "As he embarks on this new chapter, it's essential to recognize the potential within these walls to serve as a melting pot of ideas, a platform for self-discovery, and a sanctuary for those who find solace in the beauty of artistic endeavors. Sasikumar extends heartfelt gratitude to all those who tirelessly worked to bring this vision to life—the architects of his dreams, the artists who will grace these spaces, and the patrons who recognize the value of fostering creativity.",
        "Livyashree M outsetted her rec as a customary member of Radio Club and later her journey at Sangamam as a joint treasurer.",
        "She is a team worker and one who stands unique in her own way. As a volunteer and as a coordinator her involvement in Fiestaa 22 showed up her skills in content creation, hosting, organizing events. With the great coordination and capacity to handle different events she has been an energetic student throughout her journey at Sangamam. Some new ideas lead to greater adversity, Livyashree along with the team has done many successful events such as Sangamam23 and Fiestaa 23, which made her as an embarking president for this academic year. Getting up the team ready for the upcoming adventures throughout the year.",
        "",
        "Whether you're after adventure and new experiences, making friends and meeting new people, or if you just want to explore something you love, explore your options from among the types of clubs listed below.",
        "Through thought-provoking, and educational activities KPRIETians learn culture, science, and math",
        "Promoting various types of Dance among KPRIET community",
        "Designed for students interested in learning more about the aspects of theater",
        "It will encourage KPRIET community to participate and take up meaningful environmental activities",
        "Giving students the chance to host their own shows and team them to create documentaries and videos professionally",
        "Provides opportunity to learn and develop a deeper understanding of music through various activities",
        "Engages students who exhibit interest and talent in media and help them develop skills related to it",
        "Organising community development Workshops and volunteering for noble causes in coimbatore",
        "Tamil mandram is a cultural club that promotes the value and heritage of Tamil, one of the world's oldest languages",
        "To develop an insight into students to the working of parliament, politics and to train them for group discussions and social responsibilities",
        "An initiative to make students engage in Self Development, Skill Building, Community Service and Nation Building",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}