{
    "title": "Science and Humanities, Basic Engineering, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Departments of Chemistry, Physics, Mathematics and English",
        "We are excited to guide First year students through an innovative approach to foundational engineering education.",
        "The Freshmen Program is designed to integrate core Engineering Concepts with a dynamic, gamified learning experience. This approach ensures that students engage with fundamental principles in a way that is both effective and enjoyable, laying a strong foundation for their future studies.",
        "As the Program Leads, we—Dr. P Naveen from the Department of Electrical and Electronics Engineering and Dr. K Karthikeyan from the Department of Mathematics—are honored to spearhead this programme. Our goal is to blend rigorous academic content with engaging, interactive methods to enhance the educational experience for all new students.",
        "By incorporating gamification into our curriculum, we aim to make learning more interactive and stimulating. This method helps students grasp complex concepts with greater ease and enthusiasm.The success of this program relies on the collective effort of our dedicated faculty and staff.",
        "Department of Engineering Physics recognized as a Research Hub, this department is renowned for its robust research environment and state-of-the-art facilities, which support advanced study and experimentation in Physics.Department of Engineering Chemistry known for its interdisciplinary research and substantial funding, this department excels in integrating chemical sciences with real-world applications, offering comprehensive Ph.D. programs and state-of-the-art laboratory infrastructure.Department of Engineering Mathematics with a faculty comprising experts in diverse mathematical fields, this department stands out for its extensive research output and innovative teaching methods, enhancing students' problem-solving skills and theoretical understanding.Department of English focused on bridging technical knowledge with effective communication, this department is dedicated to improving students' language and professional skills, ensuring they are well-prepared for collaborative and professional environments. Mathematics, Physics and Chemistry departments are recognized as a Research Centre by Anna University, Chennai. We are passionate about providing a rich and engaging learning environment that not only meets current educational standards but also prepares students for future challenges in the engineering field.",
        "The Department encompasses five major disciplines such as Mathematics, Physics, Chemistry, English and Physical Education",
        "The Department of Engineering Physics, established in 2009, caters to the basic foundation course, Engineering Physics, a baseline for any engineering stream. We have ten highly qualified and dedicated faculty members with specialization in various disciplines of Physics. As a result, the department enjoys the privilege of being one of the  research departments in the Institution. It has been duly recognized as a Research Centre by Anna University, Chennai, for conducting Ph.D. programs. Faculty members have served as resource person in conferences, workshops and faculty development programs. Some of them serve reviewers for reputed journals. We have created research labs in different areas to accommodate the evolving research requirements of faculty and PhD students. Five faculty members are recognised research supervisors of Anna University.",
        "To become a premier science department by imparting scientific knowledge through teaching and research in physics.",
        "Established in 2009, the Department of Engineering Chemistry stands as one of the oldest departments at KPR Institute of Engineering and Technology. Boasting a cadre of highly qualified faculty members with expertise in both academia and research, the department is dedicated to adhering to the principles of Outcome Based Education (OBE) in its teaching and learning processes. Engaging in interdisciplinary research, the faculty members actively support B.E/B.Tech. students in their projects. The department has a storied tradition of delivering high-quality teaching and conducting cutting-edge research in various thrust areas of chemical science",
        "Recognized as a research center by the Centre for Research, Anna University, Chennai, the Department of Engineering Chemistry offers full-time/part-time Ph.D. programs in seven specializations such as Materials, Polymers, Medicinal, Analytical, Inorganic, Organic, and Physical chemistry. It provides rigorous research training to both students and scholars, facilitated by a state-of-the-art laboratory infrastructure. The initial financial support for the department amounted to 1 lakh from AICTE in 2011. Subsequently, in 2018, the department attained its inaugural DST-SERB project grant, securing 27 lakhs and accomplishing the project successfully by 2021. Currently, the department has acquired funds totaling 7 lakhs from UGC-DAE, along with the DST Women Scientist Scholarship. Further grants include a CSIR – EMR grant of 27 lakhs, TNSCST student project funding and conference support from DRDO.",
        "Eight scholars from the department have successfully completed their Ph.D., and another Sixteen scholars are currently pursuing their Ph.D. with funding from the KPR Institute fellowship. Faculty members have completed Post-Doctoral Fellowships in countries such as Italy, China, Malaysia, France, and South Korea. The department's faculty has an impressive publication record, contributing papers to highly reputable journals.",
        "Additionally, the department hosts visiting professors from abroad and esteemed institutes, enriching the academic environment by sharing their insights with students and scholars. The overarching goal of the Department of Engineering Chemistry is to cultivate excellence among students and research scholars in their respective disciplines by imparting extensive knowledge about the fundamental principles of science.",
        "To enable students, explore new frontiers in chemistry through teaching, research, innovation and collaboration for the betterment of the society",
        "The Department of Engineering Mathematics was established in 2009, the year of establishment of the institute. The department is one of the most active departments with faculty strength 16. Out of 16 faculty members, 15 members possess PhDs in different areas of specialization namely Differential Equations, Control Theory, Fluid Dynamics, Graph Theory, Fractional Differential Equations, Topology, Operator Theory etc., Total number of research papers published in the national/international Journals collectively by the department runs to 150 in numbers. The objective of the department is to equip Engineering students with the power of reasoning and Mathematical conceptual knowledge which would enable them to model and solve real-life problems encountered in Science and Technology. The department has organized many offline and online workshops, webinars, and Faculty Development Programme for students, research scholars, and faculty members in and around the nation.",
        "To be the centre of excellence in teaching - learning process and research in the field of mathematics.",
        "Established in 2009, The Department of English is designed to cater to a comprehensive range of communication needs for engineering students. We offer courses, tailored to meet the diverse requirements of students in professional contexts. Our team comprises eight faculty members, each specializing in various genres of English Language Teaching. With a commitment to excellence, we strive to bridge the gap between technical expertise and effective communication skills.",
        "Our courses not only enhance the language skills but also explore the broader social and ethical dimensions of engineering. The department empowers aspiring engineers with linguistic and professional skills essential for success in the collaborative working landscape.",
        "To emerge as an intellectual hub for studies in humanities through innovations in teaching, multidisciplinary research and social outreach programmes"
    ]
}