{
    "title": "Sustainable Development Goals (SDG), KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "The Sustainable Development Goals or Global Goals are a collection of 17 interlinked global goals designed to be a \"shared blueprint for peace and prosperity for people and the planet, now and into the future\". The SDGs were set up in 2015 by the United Nations General Assembly and are intended to be achieved by 2030. Wikipedia",
        "The 2030 Agenda for Sustainable Development, adopted by all United Nations Member States in 2015, provides a shared blueprint for peace and prosperity for people and the planet, now and into the future.",
        "ERROR:  An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again, or access the file",
        "KPRIET-“Ocean” Center for Art and Cultural Development - Heritage Tour",
        "Swatchh Bharath (Clean Campaign)",
        "National Unity - Run for Unity",
        "\"Asian Book of Records\", Basic Life Support and Recovery Position",
        "A bird awareness event on \"Role of Birds in Ecosystem\"",
        "“Vaccination Drive” at Town Hall",
        "Make the place around the college a Tobacco Free Environment",
        "Coimbatore District Authorities have taken initiatives with the theme \"Namma Ooru Super\"",
        "Free Eye Camp",
        "COVID Vaccination Drive",
        "Health Camp conducted in association with Daisy Hospitals in KPRIET campus",
        "Child Eye Care Training and Awarenesss with Aravindh Eye Hospital sponsored by USAID",
        "Vaccination Camp, KPRIET",
        "Vaccination Drive",
        "Covid-19 Vaccination Drive at KPRIET Campus",
        "“Vaccination Drive” at KPRIET Campus",
        "EYE Camp",
        "Vaccination Drive",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}