{
    "title": "Thrust Areas, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Thrust Areas",
        "Materials Science group",
        "Materials science was an early model for interdisciplinary research. Materials Science & Engineering combines Physics and Chemistry principles with various engineering disciplines to address global challenges in real-world problems.  Materials such as Metals, Semiconductors, Ceramics, Polymers, Composites, and carbon allotropes make our life easier. They are the roots of industrial growth and technological changes. All the other engineering branches are highly relying on materials scientists and engineers for the development of advanced materials. Materials scientists in the last 50 years created a whole new class of materials and products for a broad range of applications. The recent development in various technologies such as eco-friendly vehicles, low-cost & long-lasting batteries, high-speed computers with compact electronic circuits, and advanced biomedical devices, is possible due to the progress made in this field",
        "Read more",
        "Cyber Physical Systems Group",
        "Cyber Physical systems laboratory at KPR Institute of Engineering and Technology is a part of Centre for research and Development (CFRD) and it is equipped with state-of-the-art research facilities such as IoT device, embedded controllers, Computer Vision and deep learning computing systems, Quad copter, robotic vision systems. The major objective of the laboratory is",
        "mdi-star To promote interdisciplinary research in the areas of Cyber Physical Systems",
        "mdi-star To provide a collaborative research mechanism for creating innovative technologies",
        "mdi-star To support industries by developing cost effective engineering technologies",
        "Read more",
        "Renewable Energy Group",
        "Renewables appear to be the one of the source which is inexhaustible, clean, ecofriendly, and cost economic. Also, it appears to be the competitive energy among the other nonrenewable energy sources. Due to their abundance and its potential to use in the globe, they differ from the use of fossil fuel. Renewables will not even produce any kind of greenhouse gases which normally affect the climate which includes the reduction in annual rainfall and increased ambient temperature.",
        "Read more"
    ]
}