{
    "title": "Xebia Academy, KPR Institute Engineering and Technology, Autonomous Engineering Institution, Coimbatore, India",
    "headings": [
        "Xebia Academy",
        "Having a question in mind?",
        "Quick Links",
        "Study with us",
        "Life at KPRIET",
        "Approvals",
        "General Information"
    ],
    "paragraphs": [
        "Department of Artificial Intelligence and Data Science (AD) established a strategic collaboration with Xebia Academy and introduced a school of emerging technologies offering specialization in cutting-edge technologies'.",
        "",
        "Vision",
        "To provide training to the students in the specialization such as Data & AI, Cloud, DevOps, Business Agility, Security, Training & Learning, Software Development, Product Management and Quality Improvement.",
        "",
        "Role of Xebia Academy",
        "We train our Engineering graduates from the first year onwards to achieve their dream career. Xebia Academy aims to bridge the gap between the on-ground technologies and ambitious individuals, bringing proficiency to the industry. Taking advantage of our expertise in the IT sector and the client reports, we build a curriculum that is solution driven.",
        "",
        "Key Features",
        "",
        "MOU Benefits",
        "",
        "Python Programming",
        "",
        "Artificial Intelligence",
        "",
        "Data Science",
        "",
        "Machine Learning",
        "",
        "Deep Learning",
        "",
        "Image Processing",
        "",
        "NLP",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "Get answers to any questions you have about our programs, applications and more.",
        "21st Century Engineering College in Coimbatore",
        "World is transforming everyday. In the rapidly evolving engineering landscape, we have an Increased responsibility to transform the engineering education from traditional curriculum to meet the 21st century skills like Creativity, Critical Thinking, Collaboration and Communication. Through our unique and strategic approach we enable our students to learn beyond and prepare them for life long success."
    ]
}